src/cf/src/InformationRegisters/СведенияОПользователяхКупорос/СведенияОПользователяхКупорос.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователяхКупорос</name>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиУчитыватьОбеденноеВремяПриРасчетеЗатраченногоВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОставлятьТекущуюЗадачуАктивнойПриБлокировкеКомпьютера</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ПараметрыПодсистемыПланированиеЗадач/ПараметрыПодсистемыПланированиеЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыПодсистемыПланированиеЗадач</name>
  <resources>
    <name>ОсновнойПрофильРаспределенияРабочегоВремени</name>
    <type>
      <types>CatalogRef.ПрофилиРаспределенияРабочегоВремени</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарь</name>
    <type>
      <types>CatalogRef.ПроизводственныеКалендари</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоЧасовДляПланированияВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/СведенияОПользователяхКупорос/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ГрафикРаботыПользователя(Пользователь) Экспорт
	
	СведенияОПользователе = СведенияОПользователе(Пользователь);
	ГрафикРаботы = СведенияОПользователе.ГрафикРаботы;
	
	Если Не ЗначениеЗаполнено(ГрафикРаботы) Тогда
		
		ГрафикРаботы = РегистрыСведений.ПараметрыПодсистемыПланированиеЗадач.ЗначениеПараметра("ОсновнойГрафикРаботы");
		
	КонецЕсли;
	
	Возврат ГрафикРаботы;
	
КонецФункции

Функция СведенияОПользователе(Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Пользователь", Пользователь);
	СведенияОПользователе = Получить(ПараметрыОтбора);
	
	Возврат СведенияОПользователе;
	
КонецФункции

Функция СведениеОПользователе(Сведение, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		
		Пользователь = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Пользователь", Пользователь);
	СведенияОПользователе = Получить(ПараметрыОтбора);
	
	Возврат СведенияОПользователе[Сведение];
	
КонецФункции

#КонецОбласти

#КонецЕсли
